---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImageFailures.InvalidHeight
source: html/5619438a-7efe-b192-a0d3-1fcaa6df2214.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImageFailures.InvalidHeight Property

The image height must be must be no more than 30000 feet.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidHeight { get; }
```